uhnp/src/Enums/ВидыДвиженийПриходРасход/ВидыДвиженийПриходРасход.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДвиженийПриходРасход</name>
  <enumValues>
    <name>Приход</name>
  </enumValues>
  <enumValues>
    <name>Расход</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Catalogs/СтатьиДвиженияДенежныхСредств/СтатьиДвиженияДенежныхСредств.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СтатьиДвиженияДенежныхСредств</name>
  <comment>(-УХ)(*ЕРПМодульМенеджера)</comment>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>ИнвестиционнаяДеятельность</name>
      <description>Инвестиционная деятельность</description>
    </items>
    <items>
      <name>ОперационнаяДеятельность</name>
      <description>Операционная деятельность</description>
    </items>
    <items>
      <name>ФинансоваяДеятельность</name>
      <description>Финансовая деятельность</description>
    </items>
    <items>
      <name>тн_ВозвратДенежныхДокументовПоставщику</name>
      <description>Возврат денежных документов поставщику</description>
    </items>
    <items>
      <name>ВозвратДенежныхСредствОтДругойОрганизации</name>
      <description>Возврат денежных средств от другой организации</description>
    </items>
    <items>
      <name>ВозвратДенежныхСредствОтПоставщика</name>
      <description>Возврат денежных средств от поставщика</description>
    </items>
    <items>
      <name>ВозвратОплатыКлиенту</name>
      <description>Возврат оплаты клиенту</description>
    </items>
    <items>
      <name>тн_ВыдачаДенежныхДокументовПодотчетнику</name>
      <description>Выдача денежных документов подотчетнику</description>
    </items>
    <items>
      <name>ВыдачаДенежныхСредствВДругуюКассу</name>
      <description>Выдача денежных средств в другую кассу</description>
    </items>
    <items>
      <name>ВыдачаДенежныхСредствВКассуККМ</name>
      <description>Выдача денежных средств в кассу ККМ</description>
    </items>
    <items>
      <name>ВыплатаЗаработнойПлаты</name>
      <description>Выплата заработной платы</description>
    </items>
    <items>
      <name>тн_ВыручкаОтПродажиТоваровРаботИУслуг</name>
      <description>Выручка от продажи товаров, работ и услуг</description>
    </items>
    <items>
      <name>тн_ИнкассацияИзБанка</name>
      <description>Инкассация из банка</description>
    </items>
    <items>
      <name>ОплатаДенежныхСредствВДругуюОрганизацию</name>
      <description>Оплата денежных средств в другую организацию</description>
    </items>
    <items>
      <name>тн_ОплатаПоставщикамЗаСырьеМатериалыТоварыРаботыУслуги</name>
      <description>Оплата поставщикам за сырье, материалы ,товары, работы и услуги</description>
    </items>
    <items>
      <name>ОплатаПоставщику</name>
      <description>Оплата поставщику</description>
    </items>
    <items>
      <name>ПеречислениеДенежныхСредствНаДругойСчет</name>
      <description>Перечисление денежных средств на другой счет</description>
    </items>
    <items>
      <name>тн_ПоступлениеДенеженыхДокументовОтПодотчетногоЛица</name>
      <description>Поступление денеженых документов от подотчетного лица</description>
    </items>
    <items>
      <name>тн_ПоступлениеДенеженыхДокументовОтПоставщика</name>
      <description>Поступление денеженых документов от поставщика</description>
    </items>
    <items>
      <name>тн_ПоступлениеДенеженыхДокументовПрочее</name>
      <description>Поступление денеженых документов прочее</description>
    </items>
    <items>
      <name>ПоступлениеДенежныхСредствИзБанкаВИностраннойВалюте</name>
      <description>Поступление денежных средств из банка (в иностранной валюте)</description>
    </items>
    <items>
      <name>ПоступлениеДенежныхСредствИзБанка</name>
      <description>Поступление денежных средств из банка (в рублях)</description>
    </items>
    <items>
      <name>ПоступлениеДенежныхСредствИзКассыККМ</name>
      <description>Поступление денежных средств из кассы ККМ</description>
    </items>
    <items>
      <name>ПоступлениеДенежныхСредствОтДругойОрганизации</name>
      <description>Поступление денежных средств от другой организации</description>
    </items>
    <items>
      <name>ПоступлениеОплатыОтКлиента</name>
      <description>Поступление оплаты от клиента</description>
    </items>
    <items>
      <name>КурсовыеРазницыПрибыль</name>
      <description>Прибыль от курсовых разниц</description>
    </items>
    <items>
      <name>тн_ПрочиеПоступленияПоТекущейДеятельности</name>
      <description>Прочие  поступления  по текущей деятельности</description>
    </items>
    <items>
      <name>тн_ПрочиеРасходныеОперации</name>
      <description>Прочие расходные операции</description>
    </items>
    <items>
      <name>СдачаДенежныхСредствВБанкВИностраннойВалюте</name>
      <description>Сдача денежных средств в банк (в иностранной валюте)</description>
    </items>
    <items>
      <name>СдачаДенежныхСредствВБанк</name>
      <description>Сдача денежных средств в банк (в рублях)</description>
    </items>
    <items>
      <name>КурсовыеРазницыУбыток</name>
      <description>Убыток от курсовых разниц</description>
    </items>
  </predefined>
  <attributes>
    <name>КорреспондирующийСчет</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>7</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаРаскрытия</name>
    <comment>(УХ)</comment>
    <type>
      <types>CatalogRef.ГруппыАналитикСтатьи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПриходРасход</name>
    <comment>(УХ)</comment>
    <type>
      <types>EnumRef.ВидыДвиженийПриходРасход</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОчередностьПлатежа</name>
    <comment>(УХ)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидДвиженияДенежныхСредств</name>
    <comment>(-УХ)</comment>
    <type>
      <types>EnumRef.ВидыДвиженийДенежныхСредств</types>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФункциональноеНаправление</name>
    <comment>(УХ)</comment>
    <type>
      <types>CatalogRef.ФункциональныеНаправления</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидАналитики1</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>ПриоритетОплаты</name>
    <type>
      <types>CatalogRef.ПриоритетыОплаты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидАналитики2</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидАналитики3</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦФО</name>
    <comment>(УХ)</comment>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидАналитики4</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидАналитики5</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидАналитики6</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>Приоритет</name>
    <comment>(УХ)</comment>
    <type>
      <types>CatalogRef.ПриоритетыПлатежей</types>
    </type>
  </attributes>
  <attributes>
    <name>Валютная</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НеУчитываетсяВНалоговойБазеАУСН</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>тн_КодБДДС</name>
    <comment>Выполнение задач №000050759</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>6</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ХозяйственныеОперации</name>
    <attributes>
      <name>ХозяйственнаяОперация</name>
      <type>
        <types>EnumRef.ХозяйственныеОперации</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

uhnp/src/CommonModules/ВстраиваниеУХСтатьиДвиженияДенежныхСредств/Module.bsl
#Область ПрограммныйИнтерфейс

Процедура ПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка) Экспорт
	
	Элементы = Форма.Элементы;
	
	ИнициализироватьРеквизитыИЭлементыФормы(Форма);
	
	ЗаполнитьСписокВыбораОчередностиПлатежа(Форма);
	ВстраиваниеУХСтатьиДвиженияДенежныхСредствКлиентСервер.ОбновитьПодсказкуОчередностьПлатежа(Форма);
	
	#Область УХ_УниверсальныеПроцессыСогласование
	ДействияСогласованиеУХСервер.НарисоватьПанельСогласованияИОпределитьСостояниеОбъекта(Форма);
	#КонецОбласти
	
КонецПроцедуры

Процедура ФормаВыбораПоХозяйственнойОперации_ПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка) Экспорт
	
	Элементы = Форма.Элементы;    
	Отборы = Форма.Параметры.Отбор; // Структура

	Если НЕ ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Отборы, "ФункциональноеНаправление") Тогда
		Возврат;			
	КонецЕсли;  
	
	ФункциональноеНаправление = Отборы.ФункциональноеНаправление;  
	
	СтруктураПараметров = ОбщегоНазначения.СтруктураСвойствДинамическогоСписка();
	
	СтруктураПараметров.ТекстЗапроса = 
	"ВЫБРАТЬ
	|	СтатьиДвиженияДенежныхСредств.Ссылка КАК Ссылка,
	|	СтатьиДвиженияДенежныхСредств.ПометкаУдаления КАК ПометкаУдаления,
	|	СтатьиДвиженияДенежныхСредств.Родитель КАК Родитель,
	|	СтатьиДвиженияДенежныхСредств.ЭтоГруппа КАК ЭтоГруппа,
	|	СтатьиДвиженияДенежныхСредств.Код КАК Код,
	|	СтатьиДвиженияДенежныхСредств.Наименование КАК Наименование,
	|	СтатьиДвиженияДенежныхСредств.КорреспондирующийСчет КАК КорреспондирующийСчет,
	|	СтатьиДвиженияДенежныхСредств.Описание КАК Описание,
	|	СтатьиДвиженияДенежныхСредств.ВидДвиженияДенежныхСредств КАК ВидДвиженияДенежныхСредств,
	|	СтатьиДвиженияДенежныхСредств.РеквизитДопУпорядочивания КАК РеквизитДопУпорядочивания,
	|	СтатьиДвиженияДенежныхСредств.ПриоритетОплаты КАК ПриоритетОплаты,
	|	СтатьиДвиженияДенежныхСредств.НаименованиеЯзык1 КАК НаименованиеЯзык1,
	|	СтатьиДвиженияДенежныхСредств.НаименованиеЯзык2 КАК НаименованиеЯзык2,
	|	СтатьиДвиженияДенежныхСредств.ХозяйственныеОперации.(
	|		Ссылка КАК Ссылка,
	|		НомерСтроки КАК НомерСтроки,
	|		ХозяйственнаяОперация КАК ХозяйственнаяОперация
	|	) КАК ХозяйственныеОперации,
	|	СтатьиДвиженияДенежныхСредств.ДополнительныеРеквизиты.(
	|		Ссылка КАК Ссылка,
	|		НомерСтроки КАК НомерСтроки,
	|		Свойство КАК Свойство,
	|		Значение КАК Значение,
	|		ТекстоваяСтрока КАК ТекстоваяСтрока
	|	) КАК ДополнительныеРеквизиты,
	|	СтатьиДвиженияДенежныхСредств.Предопределенный КАК Предопределенный,
	|	СтатьиДвиженияДенежныхСредств.ИмяПредопределенныхДанных КАК ИмяПредопределенныхДанных,
	|	СтатьиДвиженияДенежныхСредств.ФункциональноеНаправление КАК ФункциональноеНаправление
	|ИЗ
	|	Справочник.СтатьиДвиженияДенежныхСредств КАК СтатьиДвиженияДенежныхСредств";
	ОбщегоНазначения.УстановитьСвойстваДинамическогоСписка(Элементы.СписокПоХозяйственнойОперации, СтруктураПараметров);
	ОбщегоНазначения.УстановитьСвойстваДинамическогоСписка(Элементы.СписокВсе, СтруктураПараметров);

	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
			Форма.СписокПоХозяйственнойОперации,
			"ФункциональноеНаправление",
			ФункциональноеНаправление,
			ВидСравненияКомпоновкиДанных.ВСписке,
			,
			Истина,
			РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);  

	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
			Форма.СписокВсе,
			"ФункциональноеНаправление",
			ФункциональноеНаправление,
			ВидСравненияКомпоновкиДанных.ВСписке,
			,
			Истина,
			РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
	
КонецПроцедуры 

Процедура ПриЧтенииНаСервере(Форма, ТекущийОбъект) Экспорт
	
КонецПроцедуры

Процедура ПередЗаписьюНаСервере(Форма, Отказ, ТекущийОбъект, ПараметрыЗаписи) Экспорт
	
	// ОПК
	АналитикиСтатейБюджетовУХ.ЗаполнитьВидыАналитикиИзТаблицы(Форма, ТекущийОбъект, Отказ);
	// Конец ОПК
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ИнициализироватьРеквизитыИЭлементыФормы(Форма) 
	
	СоздатьРеквизитыФормы(Форма);
	СоздатьЭлементыФормы(Форма);
	
	// ОПК
	АналитикиСтатейБюджетовУХ.ПодготовитьТаблицуВидовАналитик(Форма, Форма.Элементы.ГруппаУХ, Форма.Элементы.Приоритет);
	// Конец ОПК
	
	Форма[ФормыУХ.ИмяРеквизитаИнициализацияВыполнена()] = Истина;    
	
	Форма.ИспользоватьГруппуРаскрытия	= ЗначениеЗаполнено(Форма.Объект.ГруппаРаскрытия);
	Форма.ОпределяетсяСтатьей 			= НЕ ЗначениеЗаполнено(Форма.Объект.ГруппаРаскрытия); 
	Если НЕ Форма.Элементы.ДекорацияБлокирующиеСсылки.Видимость Тогда 
		Форма.Элементы.ГруппаРаскрытия.ТолькоПросмотр = НЕ ЗначениеЗаполнено(Форма.Объект.ГруппаРаскрытия);
		Форма.Элементы.ВидыАналитикВидАналитики.ТолькоПросмотр 	= ЗначениеЗаполнено(Форма.Объект.ГруппаРаскрытия);
	КонецЕсли;	
	
	Форма.Элементы.ГруппаДополнительныеАналитики.ТолькоПросмотр = Форма.Элементы.ДекорацияБлокирующиеСсылки.Видимость;
	Форма.Элементы.ПриоритетОплаты.Видимость = Ложь;
	
КонецПроцедуры

Процедура СоздатьРеквизитыФормы(Форма)
	
	ДобавляемыеРеквизиты = Новый Массив;
	
	РасшифровкаОчередностиПлатежа = Новый РеквизитФормы(
		"РасшифровкаОчередностиПлатежа", ОбщегоНазначения.ОписаниеТипаСтрока(0));
	
	ДобавляемыеРеквизиты.Добавить(РасшифровкаОчередностиПлатежа);
	
	ДобавляемыеРеквизиты.Добавить(ФормыУХ.НовыйРеквизитИнициализацияВыполнена());
	
	ИспользоватьГруппуРаскрытия = Новый РеквизитФормы(
		"ИспользоватьГруппуРаскрытия", ОбщегоНазначения.ОписаниеТипаЧисло(1));
	ДобавляемыеРеквизиты.Добавить(ИспользоватьГруппуРаскрытия);

	ОпределяетсяСтатьей = Новый РеквизитФормы(
		"ОпределяетсяСтатьей", ОбщегоНазначения.ОписаниеТипаЧисло(1));
	ДобавляемыеРеквизиты.Добавить(ОпределяетсяСтатьей);

	Форма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	
КонецПроцедуры

Процедура СоздатьЭлементыФормы(Форма)
	
	Элементы = Форма.Элементы;
	
	// невидимая группа реквизитов УХ.

	ГруппаУХ = ФормыУХ.СоздатьГруппуФормы(
		Элементы,
		"ГруппаУХ",
		НСтр("ru = 'Реквизиты УХ'"),
		ВидГруппыФормы.ОбычнаяГруппа,
		Форма,
		Элементы.ГруппаДополнительныеРеквизиты,
		ФормыУХ.ПараметрыНевидимойГруппы()
		);
		
	// Поле ПриходРасход
	ПолеПриходРасход = ФормыУХ.СоздатьПолеФормы(
		Элементы,
		"ПриходРасход",
		НСтр("ru = 'Приход / Расход'"),
		"Объект.ПриходРасход",
		ВидПоляФормы.ПолеПереключателя,
		ГруппаУХ);
	Список = ПолеПриходРасход.СписокВыбора;
	Список.Добавить(Перечисления.ВидыДвиженийПриходРасход.ПустаяСсылка(), НСтр("ru = 'Приход или расход'"));
	Список.Добавить(Перечисления.ВидыДвиженийПриходРасход.Приход, НСтр("ru = 'Только приход'"));
	Список.Добавить(Перечисления.ВидыДвиженийПриходРасход.Расход, НСтр("ru = 'Только расход'"));
	
	// Рисуем дополнительные аналитики	
	ГруппаДополнительныеАналитики = ФормыУХ.СоздатьГруппуФормы(
		Элементы,
		"ГруппаДополнительныеАналитики",
		НСтр("ru = 'Дополнительные аналитики'"),
		ВидГруппыФормы.ОбычнаяГруппа,
		ГруппаУХ		
		);
	ГруппаДополнительныеАналитики.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная; 
	ГруппаДополнительныеАналитики.Отображение = ОтображениеОбычнойГруппы.Нет;
	
	ОпределяетсяСтатьей = ФормыУХ.СоздатьПолеФормы(
		Элементы,
		"ОпределяетсяСтатьей",
		НСтр("ru = 'Определяются статьей'"),
		"ОпределяетсяСтатьей",
		ВидПоляФормы.ПолеПереключателя,
		ГруппаДополнительныеАналитики,
		,
		,
		Новый Структура("ПриИзменении", "Подключаемый_ОпределяетсяСтатьейПриИзмененииУХ")); 	
	ОпределяетсяСтатьей.СписокВыбора.Добавить(1, " ");
	ОпределяетсяСтатьей.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Право;

	ГруппаРаскрытияВыбор = ФормыУХ.СоздатьГруппуФормы(
		Элементы,
		"ГруппаРаскрытияВыбор",
		НСтр("ru = 'Выбор группы раскрытия'"),
		ВидГруппыФормы.ОбычнаяГруппа,
		ГруппаДополнительныеАналитики,	,
		ФормыУХ.ПараметрыНевидимойГруппы()
		); 
	ГруппаРаскрытияВыбор.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда; 
	
	ГруппаРаскрытияПереключатель = ФормыУХ.СоздатьПолеФормы(
		Элементы,
		"ГруппаРаскрытияПереключатель",
		НСтр("ru = 'Определяются группой раскрытия'"),
		"ИспользоватьГруппуРаскрытия",
		ВидПоляФормы.ПолеПереключателя,
		ГруппаРаскрытияВыбор,
		,
		,
		Новый Структура("ПриИзменении", "Подключаемый_ГруппаРаскрытияПереключательПриИзмененииУХ")); 
		
    ГруппаРаскрытияПереключатель.СписокВыбора.Добавить(1, " "); 
	ГруппаРаскрытияПереключатель.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Право;
	
	ГруппаРаскрытия = ФормыУХ.СоздатьПолеФормы(
		Элементы,
		"ГруппаРаскрытия",
		НСтр("ru = 'Группа раскрытия'"),
		"Объект.ГруппаРаскрытия",
		ВидПоляФормы.ПолеВвода,
		ГруппаРаскрытияВыбор,
		,
		,
		Новый Структура("ПриИзменении", "Подключаемый_ГруппаРаскрытияПриИзмененииУХ")); 
	ГруппаРаскрытия.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;	
		
	// Приоритет
	Приоритет = ФормыУХ.СоздатьПолеФормы(
		Элементы,
		"Приоритет",
		НСтр("ru = 'Приоритет'"),
		"Объект.Приоритет",
		ВидПоляФормы.ПолеВвода,
		ГруппаУХ);
		
	// Группа "Очередность платежа"
	ПараметрыГруппы = ФормыУХ.ПараметрыНевидимойГруппы();
	ПараметрыГруппы.Вставить("Группировка", ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда);
	ГруппаОчередность = ФормыУХ.СоздатьГруппуФормы(
		Элементы,
		"ГруппаОчередностьПлатежа",
		НСтр("ru = 'Очередность платежа'"),
		ВидГруппыФормы.ОбычнаяГруппа,
		ГруппаУХ,
		,
		ПараметрыГруппы);
		
	// Поле "Очередность платежа"
	Обработчики = Новый Структура("ПриИзменении", "Подключаемый_ОчередностьПлатежаПриИзмененииУХ");
	ПараметрыПоля = Новый Структура;
	ПараметрыПоля.Вставить("КнопкаВыпадающегоСписка", Истина);
	Очередность = ФормыУХ.СоздатьПолеФормы(
		Элементы,
		"ОчередностьПлатежа",
		НСтр("ru = 'Очередность платежа'"),
		"Объект.ОчередностьПлатежа",
		ВидПоляФормы.ПолеВвода,
		ГруппаОчередность,
		,
		ПараметрыПоля,
		Обработчики);
		
	// Поле "Расшифровка очередности платежа"
	ПараметрыПоля = Новый Структура;
	ПараметрыПоля.Вставить("ПоложениеЗаголовка", ПоложениеЗаголовкаЭлементаФормы.Нет);
	ПараметрыПоля.Вставить("ЦветТекста", ЦветаСтиля.ПоясняющийТекст);
	РасшифровкаОчередностиПлатежа = ФормыУХ.СоздатьПолеФормы(
		Элементы,
		"РасшифровкаОчередностиПлатежа",
		НСтр("ru = 'Расшифровка очередности платежа'"),
		"РасшифровкаОчередностиПлатежа",
		ВидПоляФормы.ПолеНадписи,
		ГруппаОчередность,
		,
		ПараметрыПоля);
		
	// Поле "Функциональное направление"
	ПараметрыПоля = Новый Структура;
	ПараметрыПоля.Вставить("ПодсказкаВвода", "<" + НСтр("ru = 'Все направления'") + ">");
	ФункциональноеНаправление = ФормыУХ.СоздатьПолеФормы(
		Элементы,
		"ФункциональноеНаправление",
		НСтр("ru = 'Функциональное направление'"),
		"Объект.ФункциональноеНаправление",
		ВидПоляФормы.ПолеВвода,
		ГруппаУХ,
		,
		ПараметрыПоля);
	
	// Группа "Лимиты аналитик"
	ПараметрыГруппы = ФормыУХ.ПараметрыНевидимойГруппы();
	ПараметрыГруппы.Вставить("Группировка", ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда);
	ГруппаЛимитыАналитик = ФормыУХ.СоздатьГруппуФормы(
		Элементы,
		"ГруппаЛимитыАналитик",
		НСтр("ru = 'Лимиты аналитик'"),
		ВидГруппыФормы.ОбычнаяГруппа,
		ГруппаУХ,
		,
		ПараметрыГруппы);
		
	// Декорация-отступ
	ПараметрыПоля = Новый Структура;
	ПараметрыПоля.Вставить("Ширина", 1);
	ПараметрыПоля.Вставить("ГоризонтальноеПоложение", ГоризонтальноеПоложениеЭлемента.Лево);
	ПараметрыПоля.Вставить("РастягиватьПоГоризонтали", Ложь);
	ФормыУХ.СоздатьДекорациюФормы(
		Элементы,
		"ДекорацияОтступУХ",
		" ",
		ВидДекорацииФормы.Надпись,
		ГруппаЛимитыАналитик,
		,
		ПараметрыПоля);
	
КонецПроцедуры

Процедура ЗаполнитьСписокВыбораОчередностиПлатежа(Форма)
	
	Элементы = Форма.Элементы;
	
	// Заполним список выбор
	СписокОчередностьПлатежа = ДенежныеСредстваВстраиваниеУХКлиентСервер.ПолучитьСписокОчередностьПлатежа(ТекущаяДатаСеанса());
	СписокВыбора = Элементы.ОчередностьПлатежа.СписокВыбора;
	СписокВыбора.Очистить();
	Для Каждого ЭлементДанных Из СписокОчередностьПлатежа Цикл
		СписокВыбора.Добавить(ЭлементДанных.Значение, ЭлементДанных.Представление);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
